In [1]:
import pandas as pd

In [5]:
df=pd.read_csv('landprices.csv')
df

         area   price
0    Ameerpet    2000
1     SRNagar    3000
2     Miyapur    4000
3    Moosapet    5000
4          KP    6000
5        KPHB    7000
6  HitechCity  800000

In [6]:
df.describe()

               price
count       7.000000
mean   118142.857143
std    300675.588507
min      2000.000000
25%      3500.000000
50%      5000.000000
75%      6500.000000
max    800000.000000

In [8]:
#zeroth percentile data point
df['price'].quantile(0)

np.float64(2000.0)

In [9]:
#zeroth next percentile data point
df['price'].quantile(0.01)

np.float64(2060.0)

In [10]:
#25th percentile data point
df['price'].quantile(0.25)

np.float64(3500.0)

In [11]:
#50th percentile data point
df['price'].quantile(0.50)

np.float64(5000.0)

In [12]:
#75th percentile data point
df['price'].quantile(0.75)

np.float64(6500.0)

In [13]:
#last percentile data point
df['price'].quantile(1)

np.float64(800000.0)

In [14]:
#first quarter
df['price'].quantile(0.25,interpolation='linear')

np.float64(3500.0)

In [15]:
df['price'].quantile(0.25,interpolation='lower')

np.int64(3000)

In [16]:
df['price'].quantile(0.25,interpolation='higher')

np.int64(4000)

In [17]:
df['price'].quantile(0.25,interpolation='nearest')

np.int64(4000)

In [18]:
df['price'].quantile(0.25,interpolation='midpoint')

np.float64(3500.0)

In [19]:
df1=pd.read_csv('landprices2.csv')
df1

       area  price
0  Ameerpet   2000
1   SRNagar   3000
2   Miyapur   4000
3  Moosapet   5100
4        KP   6000
5      KPHB   7000

In [26]:
df1.describe()

             price
count     6.000000
mean   4516.666667
std    1876.610420
min    2000.000000
25%    3250.000000
50%    4550.000000
75%    5775.000000
max    7000.000000

In [20]:
#zeroth percentile data point
df1['price'].quantile(0)

np.float64(2000.0)

In [21]:
#zeroth next percentile data point
df1['price'].quantile(0.01)

np.float64(2050.0)

In [22]:
#25th percentile data point
df1['price'].quantile(0.25)

np.float64(3250.0)

In [23]:
#50th percentile data point
df1['price'].quantile(0.50)

np.float64(4550.0)

In [24]:
#75th percentile data point
df1['price'].quantile(0.75)

np.float64(5775.0)

In [25]:
#last percentile data point
df1['price'].quantile(1)

np.float64(7000.0)

In [27]:
df

         area   price
0    Ameerpet    2000
1     SRNagar    3000
2     Miyapur    4000
3    Moosapet    5000
4          KP    6000
5        KPHB    7000
6  HitechCity  800000

In [37]:
#Removing outlier value
x=df['price'].quantile(1)
without_outlier_data=df[df['price']<x]
without_outlier_data

       area  price
0  Ameerpet   2000
1   SRNagar   3000
2   Miyapur   4000
3  Moosapet   5000
4        KP   6000
5      KPHB   7000